# Настройка устройств
CLIENTS = [{"ip": "192.168.3.8", "port": 502}, {"ip": "192.168.3.9", "port": 502}]
MODULES = [{"name": "Module_A3", "model": "Razumdom_DRM88R",
            "unit_id": 3, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A4", "model": "Razumdom_DRM21R",
            "unit_id": 4, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A5", "model": "Razumdom_DRM21R",
            "unit_id": 5, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A6", "model": "Razumdom_DRM21R",
            "unit_id": 6, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A8", "model": "Razumdom_DRM88R",
            "unit_id": 8, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A9", "model": "Razumdom_DDL88R",
            "unit_id": 9, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A10", "model": "Razumdom_DDL88R",
            "unit_id": 10, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []},

           {"name": "Module_A11", "model": "Razumdom_DDL88R",
            "unit_id": 11, "baud_rate": 115200, "data_bits": 8, "parity": "N", "stop_bits": 1,
            "scenarios": []}
           ]

SCENARIOS_REGISTERS = {"Сценарий 0": [100, 13], "Сценарий 1": [120, 13], "Сценарий 2": [140, 13],
                       "Сценарий 3": [160, 13], "Сценарий 4": [180, 13], "Сценарий 5": [200, 13],
                       "Сценарий 6": [220, 13], "Сценарий 7": [240, 13], "Сценарий 8": [260, 13],
                       "Сценарий 9": [280, 13], "Сценарий 10": [300, 13], "Сценарий 11": [320, 13],
                       "Сценарий 12": [340, 13], "Сценарий 13": [360, 13], "Сценарий 14": [380, 13],
                       "Сценарий 15": [400, 13], "Сценарий 16": [420, 13], "Сценарий 17": [440, 13],
                       "Сценарий 18": [460, 13], "Сценарий 19": [480, 13], "Сценарий 20": [500, 13],
                       "Сценарий 21": [520, 13], "Сценарий 22": [540, 13], "Сценарий 23": [560, 13],
                       "Сценарий 24": [580, 13], "Сценарий 25": [600, 13], "Сценарий 26": [620, 13],
                       "Сценарий 27": [640, 13], "Сценарий 28": [660, 13], "Сценарий 29": [680, 13],
                       "Сценарий 30": [700, 13], "Сценарий 31": [720, 13], "Сценарий 32": [740, 13],
                       "Сценарий 33": [760, 13], "Сценарий 34": [780, 13], "Сценарий 35": [800, 13],
                       "Сценарий 36": [820, 13], "Сценарий 37": [840, 13], "Сценарий 38": [860, 13],
                       "Сценарий 39": [880, 13], "Сценарий 40": [900, 13], "Сценарий 41": [920, 13],
                       "Сценарий 42": [940, 13], "Сценарий 43": [960, 13], "Сценарий 44": [980, 13],
                       "Сценарий 45": [1000, 13], "Сценарий 46": [1020, 13], "Сценарий 47": [1040, 13],
                       "Сценарий 48": [1060, 13], "Сценарий 49": [1080, 13], "Сценарий 50": [1100, 13],
                       "Сценарий 51": [1120, 13], "Сценарий 52": [1140, 13], "Сценарий 53": [1160, 13],
                       "Сценарий 54": [1180, 13], "Сценарий 55": [1200, 13], "Сценарий 56": [1220, 13],
                       "Сценарий 57": [1240, 13], "Сценарий 58": [1260, 13], "Сценарий 59": [1280, 13],
                       "Сценарий 60": [1300, 13], "Сценарий 61": [1320, 13], "Сценарий 62": [1340, 13],
                       "Сценарий 63": [1360, 13]
                       }
